spec/cassettes/StripeWrapper/StripeWrapper_Charge/_create/with_invalid_card/contains_an_error_message.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: US-ASCII
      string: card[number]=4000000000000002&card[exp_month]=6&card[exp_year]=2018&card[cvc]=314
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.27.0
      Authorization:
      - Bearer sk_test_AaIL16BJY28ihTnOkHj2XvxN
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.27.0","lang":"ruby","lang_version":"2.3.0 p-1 (2015-04-15)","platform":"x86_64-darwin14","engine":"ruby","publisher":"stripe","uname":"Darwin
        Toms-MacBook-Air-2.local 14.0.0 Darwin Kernel Version 14.0.0: Fri Sep 19 00:26:44
        PDT 2014; root:xnu-2782.1.97~2/RELEASE_X86_64 x86_64","hostname":"Toms-MacBook-Air-2.local"}'
      Content-Length:
      - '81'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 23 Sep 2015 05:09:31 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '781'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_729pzrr3z6o6tn
      Stripe-Version:
      - '2015-06-15'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_16o5VXKvv4sqfP0NVs3YV7nm",
          "livemode": false,
          "created": 1442984971,
          "used": false,
          "object": "token",
          "type": "card",
          "card": {
            "id": "card_16o5VXKvv4sqfP0N8yk6QuBK",
            "object": "card",
            "last4": "0002",
            "brand": "Visa",
            "funding": "credit",
            "exp_month": 6,
            "exp_year": 2018,
            "fingerprint": "E7kF800Rn7Ck1iVU",
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null,
            "cvc_check": "unchecked",
            "address_line1_check": null,
            "address_zip_check": null,
            "tokenization_method": null,
            "dynamic_last4": null,
            "metadata": {}
          },
          "client_ip": "59.167.223.177"
        }
    http_version: 
  recorded_at: Wed, 23 Sep 2015 05:09:31 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: US-ASCII
      string: amount=1000&currency=usd&source=tok_16o5VXKvv4sqfP0NVs3YV7nm
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.27.0
      Authorization:
      - Bearer sk_test_AaIL16BJY28ihTnOkHj2XvxN
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.27.0","lang":"ruby","lang_version":"2.3.0 p-1 (2015-04-15)","platform":"x86_64-darwin14","engine":"ruby","publisher":"stripe","uname":"Darwin
        Toms-MacBook-Air-2.local 14.0.0 Darwin Kernel Version 14.0.0: Fri Sep 19 00:26:44
        PDT 2014; root:xnu-2782.1.97~2/RELEASE_X86_64 x86_64","hostname":"Toms-MacBook-Air-2.local"}'
      Stripe-Account:
      - acct_16nOEmIDysV1eWIb
      Content-Length:
      - '60'
  response:
    status:
      code: 402
      message: Payment Required
    headers:
      Server:
      - nginx
      Date:
      - Wed, 23 Sep 2015 05:09:35 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '162'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_729pbH053FBo8I
      Stripe-Account:
      - acct_16nOEmIDysV1eWIb
      Stripe-Version:
      - '2015-06-15'
    body:
      encoding: UTF-8
      string: |
        {
          "error": {
            "message": "Your card was declined.",
            "type": "card_error",
            "code": "card_declined",
            "charge": "ch_16o5VbIDysV1eWIbje8jDW3t"
          }
        }
    http_version: 
  recorded_at: Wed, 23 Sep 2015 05:09:36 GMT
recorded_with: VCR 2.9.3
